fashiongirl = {
    "g17035188-zhenskie-shtany-losiny": "Штани та шорти+Лосіни та Легінси",
    "g23662804-zhenskie-sportivnye-kostyumy": "Спортивний одяг+Спортивні костюми",
    "g24495675-zhenskie-povsednevnye-kostyumy": "Костюми+Брючні костюми",
    "g17032386-zhenskie-platya-batal": "Плаття+Довгі сукні",
    "g124332931-zhenskie-domashnie-kostyumy": "Одяг для дому та сну+Домашній одяг",
    "g24495885-zhenskie-kurtki-vetrovki": "Верхній одяг+Вітровки",
    "g23662821-zhenskie-kofty-batal": "Кофти+Худі",
    "g24500781-zhenskie-yubki-shorty": "Спідниці+Міні-спідниці",
    "g24495707-zhenskie-bluzki-batal": "Сорочки та блузи+Блузи",
    "g23640554-zhenskie-futbolki-majki": "Майки й футболки+Футболки",
    "g11206699-zhenskie-letnie-platya": "Плаття+Короткі сукні",
    "g13693977-zhenskie-demisezonnye-platya": "Плаття+Вечірні сукні",
    "g4419875-zhenskie-futbolki-majki": "Майки й футболки+Футболки",
    "g13741909-zhenskie-bluzki-rubashki": "Сорочки та блузи+Сорочки",
    "g23662230-zhenskie-kostyumy-kezhual": "Костюми+Брючні костюми",
    "g4419800-zhenskie-sportivnye-kostyumy": "Спортивний одяг+Спортивні костюми",
    "g4536044-zhenskie-shtany-bryuki": "Штани та шорти+Брюки",
    "g6623982-zhenskie-kurtki-vetrovki": "Верхній одяг+Вітровки",
    "g2608530-zhenskie-yubki-shorty": "Спідниці+Міні-спідниці",
    "g124284809-zhenskie-domashnie-kostyumy": "Одяг для дому та сну+Домашній одяг",
    "g2639589-zhenskie-losiny-legginsy": "Штани та шорти+Лосіни та Легінси",
    "g13742242-zhenskie-kofty-optom": "Кофти+Светри",
    "g2685539-zhenskie-komplekty-nabory": "Костюми+Костюми з шортами"
}
shafa = {
    "Верхній одяг": {
        "Пальто": [],
        "Плащи": [],
        "Куртки": [],
        "Шуби": [],
        "Жилетки": [],
        "Піджаки і жакети": [],
        "Пуховики": [],
        "Парки": [],
        "Дублянки": [],
        "Дощовики": [],
        "Вітровки": []
    },
    "Плаття": {
        "Короткі сукні": [],
        "Сукні міді": [],
        "Довгі сукні": [],
        "Вечірні сукні": [],
        "Весільні сукні": [],
        "Сарафани": [],
        "Туніки": []
    },
    "Спідниці": {
        "Міні-спідниці": [],
        "Міді спідниці": [],
        "Довгі спідниці": []
    },
    "Майки й футболки": {
        "Футболки": [],
        "Майки": [],
        "Поло": [],
        "Топи": []
    },
    "Сорочки та блузи": {
        "Сорочки": [],
        "Блузи": [],
        "Вишиванки": [],
        "Боді": []
    },
    "Кофти": {
        "Джампери": [],
        "Светри": [],
        "Кардигани": [],
        "Водолазки": [],
        "Світшоти": [],
        "Худі": [],
        "Пуловери": [],
        "Толстовки": [],
        "Накиди": [],
        "Болеро": [],
        "Пончо": [],
        "Реглани": [],
        "Лонгсліви": [],
        "Жилети": []
    },
    "Спідня білизна": {
        "Бюстгальтери": [],
        "Трусики": [],
        "Комплекти": [],
        "Купальники": [],
        "Шкарпетки": [],
        "Боді": [],
        "Корсети": [],
        "Панчохи": [],
        "Колготки": [],
        "Пеньюари": [],
        "Термобілизна": [],
        "Портупеї": [],
        "Еротична білизна": [],
        "Еротичні костюми": [],
        "Білизняні майки": []
    },
    "Спортивний одяг": {
        "Спортивні костюми": [],
        "Спортивні штани": [],
        "Лосіни": [],
        "Шорти": [],
        "Топи": [],
        "Кофти": [],
        "Майки": [],
        "Капрі": [],
        "Комбінезони": [],
        "Білизна": []
    },
    "Костюми": {
        "Костюми з сукнею": [],
        "Костюми з шортами": [],
        "Костюми зі спідницею": [],
        "Брючні костюми": []
    },
    "Комбінезони": {
        "Джинсові комбінезони": [],
        "Брючні комбінезони": [],
        "Комбінезони з шортами": []
    },
    "Одяг для дому та сну": {
        "Домашній одяг": [],
        "Піжами": [],
        "Нічні сорочки": [],
        "Халати": [],
        "Маски для сну": []
    },
    "Спецодяг": {
        "Для свери обслуговування": [],
        "Медичний одяг": [],
        "Робочий спецодяг": [],
        "Захисний спецодяг": [],
        "Академічний одяг": [],
        "Формений одяг": []
    },
    "Взуття": {
        "Черевики": [],
        "Ботильйони": [],
        "Чоботи": [],
        "Кросівки": [],
        "Кеди": [],
        "Снікери": [],
        "Уггі": [],
        "Дутики": [],
        "Ботфорти": [],
        "Гумові чоботи": [],
        "Валянки": [],
        "Сабо": [],
        "Шльопанці": [],
        "В'єтнамки": [],
        "Туфлі": [],
        "Балетки": [],
        "Лофери": [],
        "Оксфорди": [],
        "Броги": [],
        "Босоніжки": [],
        "Сандалі": [],
        "Сліпони": [],
        "Мокасини": [],
        "Еспадрільї": [],
        "Капці": [],
        "Чешки": [],
        "Аквашузи": [],
        "Аксесуари для взуття": []
    },
    "Штани та шорти": {
        "Брюки": [],
        "Джинси": [],
        "Лосіни та Легінси": [],
        "Шорти": [],
        "Бриджи": []
    }
}
